// --------------------------------------------------------------------------
// ✅ 오늘 할 일 (Today Do it) 과제 수행
// --------------------------------------------------------------------------
// - [ ] "오늘 할 일" UI 디자인 해설 (Figma URL : https://오늘할일.lrl.kr)
// - [ ] "오늘 할 일" UI 디자인을 분석합니다.
// - [ ] Today Do it 앱 컴포넌트 트리를 구성합니다.
// - [ ] Today Do it 앱에서 관리되어야 할 상태를 선언합니다.
// - [ ] Pocketbase 솔루션을 사용해 백엔드 환경을 구성합니다.
// - [ ] Today Do it 리액트 앱과 백엔드 환경이 동기화되도록 구성합니다.
// --------------------------------------------------------------------------

import S from './TodayDoit.module.css';

function TodayDoit() {
  return (
    <div className={S.component}>
      <p>Today Do it (4주차 주말 마지막 과제 수행)</p>
    </div>
  );
}

export default TodayDoit;
